import { Container, Flex, Text,Link } from "@chakra-ui/react";
import React from "react";
import Footer from "../components/Footer";
import Navbar from "../components/Navbar";
import {ArrowForwardIcon } from "@chakra-ui/icons";
import { useNavigate } from "react-router-dom";


const BookDownload = () => {
    const navigate= useNavigate()
  return (
    <>
      <Navbar />
      <Container maxW={"6xl"} >
        <iframe
          width="100%"
          height={"738"}
          src="https://www.youtube.com/embed/Nu0x6dvSfSA"
          title="१५ अगस्त समारोह - गो संस्कृति पुस्तक - गुरु, गोविंद और गोमाता को समर्पित - निःशुल्क डाउनलोड करें"
          frameborder="0"
          allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
          allowfullscreen
        ></iframe>
        <Flex my={8} gap={5} textAlign={"justify"} color={"text.300"} flexDirection={"column"}>
          <Text fontSize={"22px"}  fontWeight={500}>
            पूर्ण सुख और समृद्धि का आधार - गो-संस्कृति
          </Text>
          <Text fontSize={"22px"} fontWeight={500}>
            गो कृपा कृषि पद्धति तथा गो आधारित आयुर्वेदिक जीवन-शैली के
            आध्यात्मिक, आयुर्वेदिक और वैज्ञानिक पक्ष
          </Text>
          <Text fontSize={"22px"} fontWeight={500}>
            गोपाल सुतरिया
            <br />
            बंसी गीर गोशाला एवं गोतीर्थ विद्यापीठ
          </Text>
          <Text fontSize={"19px"} fontWeight={500}>
            आज १५ अगस्त २०२२ के शुभ दिवस पर, बड़े आनंद और उत्साह के साथ हमारे
            संस्थापक श्री गोपालभाई सुतरिया द्वारा लिखित पुस्तक "पूर्ण सुख और
            समृद्धि का आधार - गो-संस्कृति" आप के समक्ष प्रस्तुत कर रहे हैं। यह
            पुस्तक आप निःशुल्क डाउनलोड कर सकते हैं।
            <br />
            <br />
            “गो-कृपा अमृतम्” बैक्टिरीअल कल्चर इस तथ्य का सर्वोच्च उदाहरण है कि
            गोमाता के आशीर्वाद से कुछ भी संभव है। आज भारत के लाखों किसान इसके
            उपयोग से सरल और स्वस्थ खेती कर आत्मनिर्भरता की दिशा में अग्रसर हैं।
            इस पुस्तक के माध्यम से हम कुछ महत्वपूर्ण और उपयोगी ज्ञान प्रकाशित कर
            रहे हैं जो किसानों को ग्राम स्तर पर ही अपने परिवार की सभी बुनियादी
            आवश्यकताओं को पूरा करने में समर्थ बना सकता है।
            <br />
            <br />
            गो आधारित कृषि, आहार और आयुर्वेद की सहायता से हम साथ मिल कर भारत की
            प्राचीन और यशस्वी गो संस्कृति का पुनः निर्माण कर सकते हैं। इस
            संभावना को वास्तविकता में परिवर्तित करने के लिए गो संस्कृति का पुनः
            निर्माण एक राष्ट्रव्यापी अभियान बन चुका है। इस अभियान में बड़ी
            संख्या में संत महात्मा, वैदिक विद्वान, आयुर्वेदाचार्य, कृषि
            वैज्ञानिक, सामाजिक संस्थाएं और गो-भक्त जुड़े हुए हैं।
            <br />
            <br />
            बंसी गीर गोशाला भी इस अभियान को सफल बनाने के लिए हर संभव प्रयास कर
            रही है और हम भारत के सभी किसानों एवं नागरिकों को इसमें अपना योगदान
            देने के लिए और इसका लाभ लेने के लिए हृदय पूर्वक आमंत्रित करते हैं।
            पूज्य गोमाता ही हमारी सभी समस्याओं का समाधान हैं। इस पुस्तक में हम
            आध्यात्मिक, आयुर्वेदिक और वैज्ञानिक पक्षों के समन्वय से समाज को एक
            सकारात्मक संदेश देना चाहते हैं।
            <br />
            <br />
            पिछले कुछ महीनों में आप में से कई गोभक्त इस पुस्तक के लिए हमारा
            संपर्क कर चुके हैं। आप सबके अविरत समर्थन तथा प्रोत्साहन के लिए हम
            आपका धन्यवाद करते हैं। गोशाला, कृषि, विद्यापीठ और अन्य कार्यों से
            कुछ समय निकाल कर लिखी गई इस पुस्तक में निश्चित रूप से एक से अधिक भूल
            हो सकती है। हमारी बिनती है कि पुस्तक पढ़ते समय हमारे भाव और उद्देश्य
            को ध्यान में रखें, और ऐसे सभी दोषों को आप क्षमा करें।
            <br />
            <br />
            इस ज्ञान यज्ञ में भाग ले कर इस पुस्तक को अवश्य पढ़ें और अधिक से अधिक
            किसान तथा गोभक्तों तक पहुँचने का प्रयास करें। आपके कीमती सुझाव,
            प्रतिक्रिया या प्रश्न हमें ईमेल से भेजें - info@bansigir.in । पुस्तक
            की नकल को प्रायोजित करने के लिए आप हमारा संपर्क कर सकते हैं।
          </Text>
        </Flex>
      
      </Container>
      <Container bgColor={"bg.500"} maxW={"container.xl"} px={0}  py={10} >
      <Flex
          
         
          justifyContent={"space-evenly"}
          alignItems={"center"}
          gap={{base:7}}
          flexDirection={{md:"row",base:"column"}}
          pl={{base:7}}
        >
       
            <Text fontSize={"xl"}>
            हमें आशा है कि गुरु, गोविंद और गोमाता को समर्पित यह पुस्तक देश और विश्व के कल्याण हेतु सहायक सिद्ध होगी।
            </Text>
         
          <Link 
           border={"1px"}
           borderRadius={"8px"}

            borderColor={"text.500"}
            _hover={{ bgColor: "text.500",color:"white" }}
            p={8}
            fontSize={"19px"}
            target="_blank"
            href="https://forms.gle/YCDyr5DQKxKWeAHR6"
            color={"text.500"}
           
            
          >
            Download Book <br/> Hindi & Gujarati
          </Link>
        </Flex>
      </Container>
    
      <Footer />
    </>
  );
};

export default BookDownload;
