import Navbar from "../components/Navbar";
import Footer from "../components/Footer";
import Accordion from "../components/Accordion";
import { Container, Box, Text,useBreakpointValue, } from "@chakra-ui/react";
import BreadCrumbCom from "../components/BreadCrumbCom";

export default function FAQS() {
  const height = useBreakpointValue({ base: "370", lg: "738" });
  const generalInformationData = [
    {
      title: "क्या खाद बनाने के लिए देसी (स्थानीय नस्ल) गोमाता के गोबर का उपयोग करना आवश्यक है?",
      content:
        "हमारा शोध बताता है कि देसी गोमाता से प्राप्त गोबर और गोमूत्र में पोषक तत्वों का स्तर सबसे अधिक होता है। हमारे प्रयोग से यह भी संकेत मिलता है कि विदेशी नस्ल गोमाता से प्राप्त गोबर और गोमुत्र या जब हम भैंस के गोबर का उपयोग करते हैं तो फफूंद और अन्य संक्रमणों की अधिक संभावना होती है। हम वास्तव में देसी गोमाता की उपस्थिति और आशीर्वाद के साथ अभ्यास करने पर खेती को आर्थिक रूप से व्यावहारिक और टिकाऊ बना सकते हैं।",
    },
    {
      title: "गोमाता की कौन सी नस्ल कृषि के लिए सर्वोत्तम है? क्या आप गीर या कुछ अन्य नस्ल की सलाह देते हैं?",
      content:
        "बंसी गीर गौशाला में, हम दृढ़ता से मानते हैं कि हमारा सामूहिक कर्तव्य गोमाता की सभी देसी नस्लों की रक्षा करना है। हमारी सभी स्वदेशी नस्लों ने हमें सदियों से अपनी उपस्थिति का आशीर्वाद दिया है, साथ ही हमें और हमारी भूमि को पोषित भी किया है। हमें केवल कुछ भारतीय या विदेशी नस्लों की ही सेवा नहीं करनी चाहिए। हम मानते हैं कि यदि हम उसकी अच्छी सेवा करते हैं, तो सभी स्वदेशी नस्लों में हमें शांति, अच्छे स्वास्थ्य और प्रचुरता के साथ आशीर्वाद देने की क्षमता है। हम गोपालन के वैदिक मानकों को बढ़ावा देने के लिए भी पूरी कोशिश कर रहे हैं और किसानों को गोमाता की देखभाल करने के लिए संबंधित जानकारी और मार्गदर्शन उपलब्ध करा रहे हैं।",
    },
    {
      title: "हम गो-कृपा अमृतम कहाँ से प्राप्त कर सकते हैं? इसकी कीमत क्या है?",
      content:
        "बंसी गीर गौशाला, भारत के सभी किसानों को गो-कृपा अमृतम निःशुल्क दे रहे है। यह पूरे भारत और किसान कल्याण के क्षेत्र में काम कर रहे विभिन्न किसान / सांस्कृतिक और धार्मिक संगठनों के हजारों स्वयंसेवक किसानों को मुफ्त में वितरित किया जा रहा है। आप बंसी गीर गौशाला से ऐसे किसानों और संगठनों का संपर्क विवरण हमें info@bansigir.in पर एक ईमेल भेजकर या हमें 9316746990 पर कॉल करके प्राप्त कर सकते हैं।",
    },
    {
      title: "क्या आप गो-कृपा अमृतम को मेरे स्थान पर कूरियर कर सकते हैं?",
      content:
        "गो-कृपा अमृतम एक यकृत जीवाणु संस्कृति है जिसे ताजी हवा के साथ निरंतर संपर्क की आवश्यकता होती है ताकि जीवाणु जीवित रह सकें। इसलिए इसे एक बोतल में छेद कैप के साथ दिया जाता है, या परिवहन में हर दो घंटे में बोतल की कैप को खोलने की आवश्यकता होती है। इस प्रकार कूरियर द्वारा गो-कृपा अमृतम भेजना संभव नहीं है। आप इसे बंसी गीर गौशाला, या अपने आस-पास के अन्य स्वयंसेवक किसानों या संगठनों से निःशुल्क ले सकते है। अधिक जानकारी के लिए कृपया हमें info@bansigir.in या 9316746990 पर संपर्क करें।",
    },
    {
      title: "गो-कृपा अमृतम ने अब तक कितने फसलों में परिणाम दिखाए हैं?",
      content:
        "गो-कृपा अमृतम ने अब तक 60 से अधिक फसलों में परिणाम दिखाए हैं। आप इस अमृतम का उपयोग किसी भी अनाज, सब्जियों, फलों आदि की खेती में कर सकते हैं। ",
    },
    {
      title: "गो-कृपा अमृतम वास्तव में क्या करता है?",
      content:
        "गो-कृपा अमृतम बैक्टीरियल कल्चर पौधों के लिए मिट्टी और वातावरण में उपलब्ध पोषक तत्वों को अवशोषित करना आसान बनाता है। यह नाइट्रोजन, पोटेशियम, फॉस्फोरस आदि जैसे महत्वपूर्ण पोषक तत्वों के अवशोषण में मदद करता है। यह कल्चर कीटों और बीमारियों के खिलाफ पौधों की प्रतिरक्षा को भी बढ़ाता है और केंचुए जैसे अनुकूल जीवों के विकास को बढ़ावा देती है।(और पढ़ें)",
    },
    {
      title: "गो-कृपा अमृतम और अपशिष्ट डिकम्पोजर में क्या अंतर है?",
      content:
        "गो-कृपा अमृतम 60 से अधिक अलग-अलग अनुकूल बैक्टीरिया के उपभेदों की संस्कृति है, जबकि अपशिष्ट डिकम्पोजर्स आमतौर पर फंगस को विघटित करने के कुछ उपभेदों का उपयोग करके विकसित किए जाते हैं। गो-कृपा अमृतम व्यापक कार्य कर सकता है, जिसमें खाद डालना, मिट्टी की उर्वरता में सुधार, भूमि की जल अवशोषण क्षमता में सुधार, जिद्दी रोगों से लड़ना आदि शामिल हैं।",
    },
  
    {
      title: "क्या हम गो-कृपा अमृतम का उपयोग अन्य प्राकृतिक या पारंपरिक खेती विधियों के साथ कर सकते हैं?",
      content:
        'हम किसानों को सलाह देते हैं कि अपनी जमीन के एक छोटे हिस्से में गो-कृपा अमृतम का उपयोग करें और फिर परिणामों के आधार पर आगे बढ़ें। जबकि गौकृपा अमृतम को अन्य प्राकृतिक खेती के तरीकों के साथ जोड़ा जा सकता है, यह दो तरीकों को न मिलाना ही आदर्श है।',
    },
    {
      title: "क्या गो-कृपा अमृतम को मिट्टी में लगाया जाना चाहिए या केवल कीटनाशक के रूप में इस्तेमाल किया जाना चाहिए?",
      content:
        'सर्वोत्तम परिणामों के लिए, गो-कृपा अमृतम को सिंचाई के पानी के साथ दिया जा सकता है, देसी गोमय से उच्च गुणवत्ता वाली खाद बनाने के लिए इस्तेमाल किया जा सकता है, और पौधों पर कीटनाशक के रूप में छिड़काव किया जा सकता है।',
    },
    {
      title: "हम बंसी गीर गौशाला या अन्य किसानों से प्राप्त प्रारंभिक गौ कृपा अमृतम जीवाणु संस्कृति का उपयोग कैसे कर सकते हैं ताकि हमारे खेत में आवश्यक रूप से अधिक संस्कृति हो सके?",
      content:
        'आप देसी गौमाता और देसी गुड़ से प्राप्त छाछ का उपयोग करके अपने स्वयं के खेत में गो-कृपा अमृतम संस्कृति को बढ़ा सकते हैं। (अधिक पढ़ें)',
    },
    {
      title: "हम उच्च गुणवत्ता वाली खाद बनाने के लिए गो-कृपा अमृतम का उपयोग कैसे कर सकते हैं?",
      content:
        'गो-कृपा अमृतम का उपयोग देसी गौमाता से प्राप्त गोमय या गोबर का उपयोग करके अपने खेतों के लिए बहुत उच्च गुणवत्ता वाली खाद बनाने के लिए किया जा सकता है। (अधिक पढ़ें)',
    },
    {
      title: "हम गो-कृपा अमृतम का उपयोग कीटनाशक के रूप में या बीमारियों को नियंत्रित करने के लिए कैसे कर सकते हैं?",
      content:
        'गो-कृपा अमृतम ने कीटों और पौधों के रोगों के प्रबंधन में काफी प्रभाव दिखाया है। (अधिक पढ़ें)',
    },
    {
      title: "बहुत गंभीर पौधों की बीमारियों के मामले में हम गो-कृपा अमृतम का उपयोग कैसे कर सकते हैं?",
      content:
        'गो-कृपा अमृतम का उपयोग बहुत पुरानी छाछ (45 दिन पुरानी), ताजे गौमूत्र और तांबे के साथ विभिन्न पौधों के रोगों को नियंत्रित करने के लिए किया जा सकता है। (अधिक पढ़ें)',
    },
   
  ];

  

  return (
    <>
      <Navbar />
      {/* <Container maxW="container.xl">
        <BreadCrumbCom second={"FAQ"} secondUrl={"/faq"} />
      </Container> */}
      <Container maxW={"container.xl"} pb={8} mt={10} px={0}>
      
          <Text
            pb={2}
            color={"brand.100"}
            textAlign={"center"}
            textShadow={"lightgreen"}
            fontSize="3xl"
            fontWeight="700"
          >
            प्रश्नोतरी & उपाय
          </Text>
      
      </Container>
      <Container maxW={"6xl"} pb={8} px={{md:20,base:5}} >
       
        <Accordion details={generalInformationData} />
        <Box  my={10} >
        <iframe width="100%" height={height} src="https://www.youtube.com/embed/DYsKmaMWXQg" title="गो-कृपा अमृतम - आपके प्रश्नो के उत्तर - https://www.youtube.com/watch?v=gpkw7adHuDo&amp;t=51s" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
        </Box>
      
      
      </Container>
      <Footer />
    </>
  );
}
