import React from "react";
import Footer from "../components/Footer";
import BreadCrumbCom from "../components/BreadCrumbCom";
import Navbar from "../components/Navbar";
import {
  Box,
  Container,
  VStack,
  Image,
  Text,
  Heading,
  GridItem,
  Grid,
} from "@chakra-ui/react";
import { useLocation } from "react-router-dom";

const Mission = () => {
  let { search } = useLocation();
  const searchParams = new URLSearchParams(search);
  const IsMobileView = searchParams.get("mobile") ?? "false";
  return (
    <>
      {IsMobileView !== "true" && <Navbar />}
      {/* <Container maxW={"container.xl"} alignContent={"flex-start"}>
    <BreadCrumbCom second={"About Us"} secondUrl={"/about-us"} />{" "}
  </Container> */}
      <Container maxW={"6xl"} mb={10} px={{md:10,xl:0,base:10}} centerContent>
        <VStack mb={12}>
          <Image src={require("../assets/images/Mission/image_1.jpg")} />
          <Box fontWeight={500} color={"brand.500"} fontSize={"30px"} my={7}>
            गौ कृपा अमृतम
          </Box>

          <Box
            maxW={"container.xl"}
           
            textAlign={{ base: "justify", md: "start" }}
          >
            <Text fontSize={"18px"}>
              गो सेवा कार्य करते हुए हमें यह ध्यान में आया है की जब तक किसान
              गोमाता की महत्ता समज कर गोमाता को अपने घर में श्रद्धा पूर्वक
              सन्माननीय स्थान नहीं देगा तब तक गोमाता की और किसान की समस्याओ का
              समाधान नहीं होगा। गोशाला पांजरापोल आपातकालीन धर्म है, गोमाता का
              सच्चा स्थान किसान का घर है।
              <br />
              <br />
              किसान के घर गोमाता पुन:प्रस्थापित करने के लिए हम काफी समय से
              प्रयत्नशील थे। गत 5-6 वर्षों से कुछ विशेष दिव्य गोमाताओं के
              पंचगव्य, कुछ हिमालय की दिव्य औषधि और दिव्य संत महापुरुषों के
              मार्गदर्शन से निर्मित मिश्रण पर अनुसन्धान करते हुए हमें दिव्य
              द्रावण (कल्चर) प्राप्त हुआ।
              <br />
              <br />
              NABL मान्य लैबोरेटरी के परीक्षण के अनुसार इस द्रावण में 55 से
              ज्यादा प्रकार के सूक्ष्म मित्र जीव (बैक्टीरिया) पाये गए हैं। इस
              द्रावण का मान्य लैबोरेटरी में मेटाजेनिक टेस्टिंग के द्वारा डीएनए
              और आरएनए विश्लेषण भी करवाया गया। यह सब परीक्षा के द्वारा द्रावण
              में पाये गए अलग अलग प्रकार (genus) के बेकटेरिया की सूची हम इस पत्र
              के साथ भेज रहे हैं। तदुपरान्त इस द्रावण का हमने अलग अलग प्रकार की
              फसलों में प्रयोग किया (field test), तो चमत्कारिक परिणाम प्राप्त
              हुए। इस द्रावण के उपयोग से किसानों को रासायनिक खाद और जहरीली
              दवाईयां (पेस्टीसाईड्स, फंगीसाईड्स) के खर्चे और दुष्परिणामों से
              छुटकारा मिलता है और गो आधारित कृषि को ज्यादा बल मिलता है और
              किसानों की खेती सरल और सहज हो जाती है।
              <br />
              <br />
              “गो-कृपा अमृतम” किसानो को थोड़े ही खर्च में अछि ओर्गेनिक फसल
              प्राप्त करने में और अपनी आय बढ़ाने में मदद कर सकता हैं, जिस से
              आदरणीय प्रधानमंत्रि श्री नरेंद्र मोदीजी का किसान की आय दुगनी करने
              के संकल्प में सहायक बनेगा।
              <br />
              <br />
              आज कोरोना के कारण सब मे ईम्यूनिटी पावर बढाने के लिए ओर्गेनिक आहार
              की मांग देश-विदेश मे बढी है। “गो-कृपा अमृतम” बैक्टीरिया के प्रसार
              के कारण किसानो के द्वारा उपजाई गई ओर्गेनिक फसल का बडी मात्रा में
              निर्य़ात किय़ा जा सकता है और यूरिया, डी ए पी, पेस्टिसाईड्स,
              फंगीसाईड्स का आयात का खर्च घटाया जा सकता है, जिससे यह द्रावण भारत
              को समृद्ध बनाने में खूब सहायक बन सकता है।
              <br />
              <br />
              गो-कृपा अमृतम के माध्यम से गौ आधारित कृषि से किसानों के घर खुशहाली
              लाकर पुन:भारत को विश्व गुरू बनाने के अभियान में आप सब के सहयोग की
              अपेक्षा करते है।
            </Text>
          </Box>
        </VStack>
        <Image src={require("../assets/images/top.png")} />
        <Grid
          templateColumns={{
            md: "repeat(2, 1fr)",
            base: "repeat(1, 1fr)",
          }}
          gap={6}
          my={12}
         
        >
          <GridItem >
            <Image my={12} src={require("../assets/images/Mission/image_3.jpg")} />
          </GridItem>
          <GridItem>
            <Heading fontSize={"27px"} color={"brand.500"} mb={5}>
              हमारे संथापक - श्री गोपालभाई सुतरिया
            </Heading>
            <Text fontSize={"18px"}>
              श्री गोपालभाई सुतारिया बंसी गीर गोशाला और गोतीर्थ विद्यापीठ के
              संस्थापक हैं। उनका जन्म १९७७में भावनगर, गुजरात में हुआ था। उनके
              जीवन और कार्य की जड़ें वास्तव में उनके परिवार में निहित हैं, जो
              उनके समर्थन का सबसे बड़ा स्रोत रहा है, विशेष रूप से उनके छोटे भाई
              और उनके काम में साथी श्री गोपेशभाई सुतारिया जो उनके अभियान की
              वित्तीय और संगठनात्मक रीढ़ हैं।
              <br />
              <br />
              गोपालभाई के दादाजी एक अनुशासित और मेहनती किसान थे, जिन्होंने अपने
              पोतों को जीवन में “सत्य” और “नीती” का महत्व सीखाने की कोशिश की।
              उनके पिता श्री गगजीभाई सुतारिया कम उम्र से ही उनके गुरुजी श्री
              परमहंस हंसानंदतीर्थ दंडीस्वामी से प्रभावित थे। गोपालभाई के परिवार
              का वातावरण सेवा की भावना से परिपूर्ण है, जिसमें बच्चों से लेकर
              परिवार के लगभग हर सदस्य को गोमाता और भारत के लिए कार्य करने की
              प्रबल इछा है।
              <br />
              <br />
              गोपालभाई, अपने भाई गोपेशभाई के साथ २००६में अहमदाबाद आए और बंसी गीर
              गोशालाकी स्थापना की। कुछ साल बाद दोनों भाइयों ने पहले छात्र के रूप
              में अपने ४ बच्चों के साथ गोतीर्थ विद्यापीठ गुरुकुल की स्थापना की।
              जैसे-जैसे समय बीतता गया, गोशाला बढ़ती गई और आज गोशाला में १८
              गोत्रों से ७०० गोमाता और नंदियों की उपस्थिती है।
              <br />
              <br />
              आज बंसी गीर गोशाला राष्ट्र में बड़े बदलाव लाने का प्रयत्न कर रही
              है, और इन गतिविधियों से आज बड़ी संख्या में संत महात्मा, गो भक्त,
              वैदिक विद्वान, कृषि वैज्ञानिक, आयुर्वेदाचार्य और किसान संगठन हृदय
              से जुड़े हुए हैं। परिवार और गोशाला से जुड़े लोगों का अटूट विश्वास
              है कि यह सब परिसर के वातावरण में गुरुजी श्री परमहंस हंसानंदतीर्थ
              दंडीस्वामी, गोविंद श्री कृष्ण और दिव्यगोमाता की ठोस उपस्थिति के
              कारण संभव हुआ है।
            </Text>
          </GridItem>
        </Grid>
        <Image  src={require("../assets/images/bottom.png")}/>
      </Container>
      {IsMobileView !== "true" && <Footer />}
    </>
  );
};

export default Mission;
